;Place localized text in this file
[TLMUpgrade_Solace X2WeaponUpgradeTemplate]
FriendlyName="Solace Upgrade"
FriendlyNamePlural="Solace Upgrades"
BriefSummary="The Unit is surrounded by an aura that immediately extinguishes or blocks any mental impairments for themselves and any nearby squadmates."
TinySummary="Solace""

[TLMUpgrade_MZWildTalent X2WeaponUpgradeTemplate]
FriendlyName="Wild Talent Upgrade"
FriendlyNamePlural="Wild Talent Upgrades"
BriefSummary="random bonus to psi offense"
TinySummary="bonus to PSI offense"

[TLMUpgrade_MindShield X2WeaponUpgradeTemplate]
FriendlyName="Mindshield Upgrade"
FriendlyNamePlural="Mindshield Upgrades"
BriefSummary="Makes unit immune to negative mental conditions such as panic and mind control."
TinySummary="Mindshield"




